{"text": "The ICE processing facility in the western suburb of Broadview has become the primary physical and symbolic battleground documented in public reporting.", "spans": [{"start": 28, "end": 62, "label": "CHI_LOCATION"}]}
{"text": "The pre-dawn raid on a five-story apartment building near 75th Street and South Shore Drive constitutes the most significant documented residential enforcement action.", "spans": [{"start": 53, "end": 91, "label": "CHI_LOCATION"}]}
{"text": "In Logan Square, federal agents in an SUV deployed a tear gas canister on a busy street near the Rico Fresh supermarket and Funston Elementary School, an incident captured on video and representing a significant use of force in a dense, public area.", "spans": [{"start": 88, "end": 149, "label": "CHI_LOCATION"}]}
{"text": "In Humboldt Park, an alderwoman was arrested by ICE agents inside Humboldt Park Health hospital while inquiring about an individual injured during an immigration arrest.", "spans": [{"start": 59, "end": 95, "label": "CHI_LOCATION"}]}
{"text": "Other reports from the area describe federal agents entering a house near Thomas Street and Harding Avenue.", "spans": [{"start": 69, "end": 106, "label": "CHI_LOCATION"}]}
{"text": "In Hermosa, multiple agents in military gear were spotted at a Home Depot and Chase Bank off Armitage and Cicero Avenues, with reports of pepper balls being fired and several people detained.", "spans": [{"start": 58, "end": 120, "label": "CHI_LOCATION"}]}
{"text": "ICE agents were documented detaining a street vendor near the intersection of South Pulaski Road and South Archer Avenue.", "spans": [{"start": 53, "end": 120, "label": "CHI_LOCATION"}]}
{"text": "Similar arrests of a tamale vendor in the Back of the Yards neighborhood and a snack vendor at a BP gas station near 46th and Damen were also reported.", "spans": [{"start": 35, "end": 72, "label": "CHI_LOCATION"}]}
{"text": "The cumulative effect of these actions was a noticeable decrease in street vendor activity along the bustling 26th Street commercial corridor in Little Village.", "spans": [{"start": 82, "end": 159, "label": "CHI_LOCATION"}]}
{"text": "Additional arrests were documented at intersections such as 47th and Marshfield and near 51st and Kedzie.", "spans": [{"start": 38, "end": 79, "label": "CHI_LOCATION"}]}
{"text": "These patrols were observed on Michigan Avenue, one of the city's busiest shopping and tourist streets, and along the Chicago Riverwalk.", "spans": [{"start": 28, "end": 46, "label": "CHI_LOCATION"}]}
{"text": "This presence was augmented by CBP boats patrolling the Chicago River.", "spans": [{"start": 52, "end": 69, "label": "CHI_LOCATION"}]}
{"text": "The most specific example involves CPD setting up checkpoints at the Division Street entrance to the lakefront path, where officers conducted bag checks.", "spans": [{"start": 62, "end": 115, "label": "CHI_LOCATION"}]}
{"text": "Their home in McKinley Park, on the 2300 block of South Damen Avenue, was wrongly targeted in a 2017 raid based on a faulty informant tip that the department failed to properly verify.", "spans": [{"start": 29, "end": 68, "label": "CHI_LOCATION"}]}